InformationRegisters/СведенияОРежимахРаботыФормыСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОРежимахРаботыФормыСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьНачислениеЗарплатыВФормеСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьКадровыйУчетВФормеСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНачислениеПоТрудовымДоговорамВФормеСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыРаботыФормыСотрудника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РежимыРаботыФормыСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>РежимыРаботыФормыСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникОформленныйПоДоговоруГПХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникОформленныйПоТрудовомуДоговору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникОформленныйПоТрудовомуДоговоруИДоговоруГПХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОРежимахРаботыФормыСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНастройкиРежимов(Знач МассивРежимовРаботы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		ЗначенияФункциональныхОпций = Новый Структура;
		ЗначенияФункциональныхОпций.Вставить("ИспользоватьНачислениеЗарплаты", Константы.ИспользоватьНачислениеЗарплаты.Получить());
		ЗначенияФункциональныхОпций.Вставить("ИспользоватьКадровыйУчет", Константы.ИспользоватьКадровыйУчет.Получить());
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СведенияОРежимахРаботыФормыСотрудника");
		БлокировкаДанных.Заблокировать();
		
		Набор = РегистрыСведений.СведенияОРежимахРаботыФормыСотрудника.СоздатьНаборЗаписей();
		Набор.Прочитать();
		
		УдаляемыеЗаписи = Новый Массив;
		
		Для каждого Запись Из Набор Цикл
			
			Если НЕ ЗначениеЗаполнено(Запись.РежимРаботы) Тогда
				УдаляемыеЗаписи.Добавить(Запись);
			КонецЕсли; 
			
			ИндексРежима = МассивРежимовРаботы.Найти(Запись.РежимРаботы);
			Если ИндексРежима <> Неопределено Тогда
				МассивРежимовРаботы.Удалить(ИндексРежима);
			КонецЕсли; 
			
			ЗаполнитьЗаписьРежимаРаботыФормы(Запись, ЗначенияФункциональныхОпций);
			
		КонецЦикла;
		
		Для каждого УдаляемаяЗапись Из УдаляемыеЗаписи Цикл
			Набор.Удалить(УдаляемаяЗапись);
		КонецЦикла;
		
		Если МассивРежимовРаботы.Количество() > 0 Тогда
			
			Для каждого РежимРаботы Из МассивРежимовРаботы Цикл
				
				Запись = Набор.Добавить();
				Запись.РежимРаботы = РежимРаботы;
				
				ЗаполнитьЗаписьРежимаРаботыФормы(Запись, ЗначенияФункциональныхОпций);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Набор.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление режимов формы сотрудника'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьЗаписьРежимаРаботыФормы(Запись, ЗначенияФункциональныхОпций)
	
	Если Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.ФизическоеЛицо Тогда
		
		Запись.ИспользоватьНачислениеЗарплатыВФормеСотрудника = Ложь;
		Запись.ИспользоватьКадровыйУчетВФормеСотрудника = Ложь;
		Запись.ИспользоватьНачислениеПоТрудовымДоговорамВФормеСотрудника = Ложь;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.Сотрудник Тогда
		
		Запись.ИспользоватьНачислениеЗарплатыВФормеСотрудника = Ложь;
		Запись.ИспользоватьКадровыйУчетВФормеСотрудника = Ложь;
		Запись.ИспользоватьНачислениеПоТрудовымДоговорамВФормеСотрудника = Ложь;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.СотрудникОформленныйПоТрудовомуДоговору Тогда
		
		Запись.ИспользоватьНачислениеЗарплатыВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьНачислениеЗарплаты;
		Запись.ИспользоватьКадровыйУчетВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьКадровыйУчет;
		Запись.ИспользоватьНачислениеПоТрудовымДоговорамВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьНачислениеЗарплаты;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.СотрудникОформленныйПоДоговоруГПХ Тогда
		
		Запись.ИспользоватьНачислениеЗарплатыВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьНачислениеЗарплаты;
		Запись.ИспользоватьКадровыйУчетВФормеСотрудника = Ложь;
		Запись.ИспользоватьНачислениеПоТрудовымДоговорамВФормеСотрудника = Ложь;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.СотрудникОформленныйПоТрудовомуДоговоруИДоговоруГПХ Тогда
		
		Запись.ИспользоватьНачислениеЗарплатыВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьНачислениеЗарплаты;
		Запись.ИспользоватьКадровыйУчетВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьКадровыйУчет;
		Запись.ИспользоватьНачислениеПоТрудовымДоговорамВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьНачислениеЗарплаты;
		
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
